Catalogs/Грузчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Грузчики</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Занятость</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/Бригады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>Бригады</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Водители</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Грузчик1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Грузчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Грузчик2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Грузчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Грузчики/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура заполнение()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	список.Очистить();
Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Грузчики.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Грузчики КАК Грузчики";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	
		Запрос2 = Новый Запрос;
	Запрос2.Текст = 
		"ВЫБРАТЬ
		|	Бригады.Грузчик1.Ссылка КАК Грузчик1Ссылка,
		|	Бригады.Грузчик2.Ссылка КАК Грузчик2Ссылка
		|ИЗ
		|	РегистрСведений.Бригады КАК Бригады
		|ГДЕ
		|	Бригады.Период = &МояДата";
	Запрос2.УстановитьПараметр("МояДата",Дата);
	РезультатЗапроса2 = Запрос2.Выполнить();
	
	Выборка2 = РезультатЗапроса2.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		  выборка2.Следующий();
		если ВыборкаДетальныеЗаписи.ссылка<>выборка2.Грузчик1Ссылка и ВыборкаДетальныеЗаписи<>выборка2.Грузчик2Ссылка тогда
			список.Добавить(ВыборкаДетальныеЗаписи.ссылка,ВыборкаДетальныеЗаписи.ссылка);	
		конецесли;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры



&НаКлиенте
Процедура Выборка(Команда)
	заполнение();
		
КонецПроцедуры

&НаСервере
функция операциявыбора(ссылка,ссылка2)
	   //объект1=ссылка2.получитьобъект(); 
	   //об2=ссылка.получитьобъект();
	    объект1=ссылка2.получитьобъект();
		объект1.Грузчик1=ссылка;
		объект1.Записать();
Конецфункции

&НаКлиенте
Процедура Выбрать(Команда)
		этаформа.ВладелецФормы.ВыделенныйТекст=элементы.Список.ТекущиеДанные.Значение;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		Дата=ЭтотОбъект.ВладелецФормы.Родитель.Объект.Дата;
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначениеПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры
